# Задание 1
# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

num1 = float(input())
num2 = float(input())

square = 0.5 * num1 * num2

print(square)



# Задание 2
# Два автомобиля едут навстречу друг другу с постоянными скоростями V1 и V2 км/ч.
# Определите, через какое время автомобили встретятся, если расстояние между ними равно S км.

s = float(input())
v1 = float(input())
v2 = float(input())

result = s / (v1 + v2)

print(float(result))



# Задание 3
# Два автомобиля едут навстречу друг другу с постоянными скоростями V1 и V2 км/ч.

